# -*- coding: cp1251 -*-
key = 20

alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
alphabet_len = len(alphabet)

msg = "Юхъхдчм, 10 мьэсшл 2018 пырм, аяэы Л ьэыюъашмюи ыя эмрыюяъыпы «ча-чм-эс-ча» х озчшкдхшм нархш иъхч ъм чыщхчс. Оюямшм, ьынэсшм ъм чавък, ьы рыэыпс очшкдхшм чыщь. Ры ьсэоыпы аэычм сёс дмю, оьышъс щыуъы ьыющыяэсяи, дяы фм ъыди ъм быэащс ъмьхюмшх. Ьычм чыщь пэафхшюл, л аюьсшм ъмшхяи юснс дмеча дмл х озюшаемяи ыя щмщз юямърмэяъыс: – Ышл, чарм яз ьыешм, ьысеи, чмч дсшыосч, фм юяышыщ о чых-яы осчх. – Мпм, – наэчъашм л, юямёхшм наясэнэыр х ыяьэмохшмюи ч щыъхяыэа. Л ьышсфшм ъм быэащ ечышз. Чмч ынздъы, хъясэъся ъыдик ухш ъмюзёсъъыц ухфъик. Нышиеыц Ынсфилъ ыьляи эмфэапмшюл ю Ьяхгсц. Рышпы эапмшхюи, ры роав дмюыо ъыдх. Оыя осфся шкрлщ, ъхчяы хв юьмяи ъс пыъхя. – Ышл, яснс озвырхяи дсэсф ьышдмюм, м яз сёс о ьхумщс! – Ъа ёмю… Л эмфрэмусъъы ыяыэомшмюи ыя чыщьм х ыяьэмохшмюи ырсомяиюл. О ечыша ямёхяиюл юяэмеъы ъс выясшыюи, ясщ нышсс дяы ьсэозщ аэычыщ ъмщсдмшмюи чыъяэышиъмл ьы щмясщмяхчс. Йяа чыъяэышиъак сёс ъс ьхюмш ъх ырхъ чшмюю, ьыйяыща ъм быэащс фмрмъхл ъс ьылохшхюи, м ьэыешыпыръхс хючмяи о мэвхос нзшы шсъи. Ьыяыщ бхфэм, хюяыэхл х яышичы ырхъ ьэхшхдъзц аэыч – ЫЧП. Рм х яы, дсща ъмю ямщ адмя! Ьсдмямяи? Ечышиъмл ьэыпэмщщм ъс щсълшмюи аус шся рсюляи! Вм! Рм юсцдмю шкныц ъыэщмшиъзц ечышиъхч ясчюя нзюяэсс ъмнсэся, дсщ ьэыпыоыэхя. Ьычм ырсомшмюи, л оюс эмоъы рыдхязомшм одсэмеъкк быэащючак эапък. Х яая пшмф орэап фмгсьхшюл фм яы, дяы о лёхчс, ычмфзомсяюл, сюяи шхдъыс юыынёсъхс. Л ыячэзшм х… юсэргс фмчышыяхшыюи дмюяы-дмюяы. Ыя Люяэснм… Юыынёсъхс нзшы чыэыясъичхщ. «Ьэхося! М а яснл ьмэсъи сюяи?» – ъы а щсъл ьэлщ эачх фмяэлюшхюи. Люяэсн фмвырхш ъм быэащ эсрчы, ъы щсячы. Хъыпрм чмч ъмьхеся дяы-ъхнари, чмч ьыеаяхя, ямч оюс х юнспмкяюл дхямяи. М ыръмурз ыъ рмус юяхвх юоых ъмьхюмш. Люяэсн – ьэыюяы щсдям оюсв рсодыъыч. О шхдчс дмюяы яышичы х ынюаурмшх, дяы Люяэсн ъыосъичыпы ъмьхеся. М пшмоъыс, ъхчяы-ъхчяы ъс фъмш, чяы ыъ ъм юмщыщ рсшс. Яы, дяы Люяэсн ъмьхюмш щъс, Юхъхдчс, йяы нзшы ьэыюяы чмч пэыщ юэсрх люъыпы ъснм. – Ышл, яз о ечыша юынхэмсеиюл? – Ёмю! Ыв, х фмдсщ яышичы чарм-яы авырхяи, сюшх оыя ыъм, ъмюяылёмл ухфъи. Юсцдмю нз юсюяи, юьычыцъы ьэхращмяи ыяося, ъмьхюмяи. М ьыяыщ озосрмяи ъыщсэ спы мюичх х нышямяи, нышямяи ъыдмщх… л му фмущаэхшмюи ыя юдмюяил. М ьыяыщ офлшм ьыэябсши х апэкщы ьыьшсшмюи ч росэх."

for key in range(0, alphabet_len):
    res = ""

    for ch in msg:
        if ch.isupper():
            ch = ch.lower()

        if ch in alphabet:
            ch_idx = 0
            for al_ch in alphabet:
                if ch == al_ch:
                    break
                ch_idx += 1

            ch_idx = ch_idx + key

            if ch_idx >= alphabet_len:
                ch_idx = ch_idx - alphabet_len

            res = res + alphabet[ch_idx]
        else:
            res = res + ch

    print(key, res)

